In [1]:
import pandas as pd

In [2]:
pd.DataFrame({'Si': [100, 200], 'No': [50, 30]})

    Si  No
0  100  50
1  200  30

In [4]:
pd.DataFrame({'Jorge': ['Pollo.', 'Carne de Res.', 'Carne de Cerdo.', 'Pescado.'], 'Aida': ['Pollo.', 'Carne de Cerdo.', 'Verduras.', 'Frutas.']})

             Jorge             Aida
0           Pollo.           Pollo.
1    Carne de Res.  Carne de Cerdo.
2  Carne de Cerdo.        Verduras.
3         Pescado.          Frutas.

In [5]:
pd.DataFrame({'Jorge': ['Pollo.', 'Carne de Res.', 'Carne de Cerdo.', 'Pescado.'], 'Aida': ['Pollo.', 'Carne de Cerdo.', 'Verduras.', 'Frutas.']},
             index=['Comida A', 'Comida B', 'Comida C', 'Comida D'])

                    Jorge             Aida
Comida A           Pollo.           Pollo.
Comida B    Carne de Res.  Carne de Cerdo.
Comida C  Carne de Cerdo.        Verduras.
Comida D         Pescado.          Frutas.

In [7]:
pd.Series([1.1, 2.2, 3.3, 4.4, 5.5, 6.6, 7.7, 8.8, 9.9])

0    1.1
1    2.2
2    3.3
3    4.4
4    5.5
5    6.6
6    7.7
7    8.8
8    9.9
dtype: float64

In [8]:
pd.Series([3.5, 4.0, 4.5, 4.0], index=['Quiz', 'Taller', 'Parcial', 'Definitiva' ], name='Estudiante Diana')

Quiz          3.5
Taller        4.0
Parcial       4.5
Definitiva    4.0
Name: Estudiante Diana, dtype: float64

In [18]:
ventas = pd.read_csv("/Machine Learning/Data/mydata_sales.csv")

In [19]:
ventas.head()

   Ventas Enero  Ventas Febrero   Ventas Marzo
0           130             201            900
1           350             340            100
2           410            1110           2011
3           677            6000           5500
4           550             700            800

In [20]:
ventas.shape

(6, 3)

In [29]:
ventas = pd.read_csv("/Machine Learning/Data/mydata_sales.csv", index_col=0)

In [30]:
ventas.head()

              Ventas Febrero   Ventas Marzo
Ventas Enero
130                      201            900
350                      340            100
410                     1110           2011
677                     6000           5500
550                      700            800

In [81]:
venta_vehiculos = pd.read_csv("/Machine Learning/Data/Ventas_vehiculos.csv")

In [82]:
venta_vehiculos.head

<bound method NDFrame.head of             Ciudad      Marca      Mes  Semana   Vehiculo  Cantidad
0         Monteria     Toyota    Enero       1       Auto       105
1         Monteria     Toyota    Enero       1    Camion          1
2           Cerete     Suzuki    Enero       1    Omnibus         2
3           Cerete     Toyota  Febrero       1  Camioneta         2
4           Lorica     Suzuki    Enero       1       Moto       583
5           Cerete    Renault  Febrero       2       Auto       121
6         Monteria    Renault    Enero       2    Camion          1
7   Cienaga de Oro      Mazda    Enero       2    Omnibus         1
8        Tierralta     Toyota    Marzo       2  Camioneta         2
9     Pueblo nuevo      Mazda    Marzo       2       Moto       485
10        Monteria     Suzuki    Abril       3       Auto       122
11    Pueblo nuevo  Chevrolet    Marzo       3    Camion          1
12          Pelayo       Ford     Mayo       3    Omnibus         2
13          Pelayo  Chevrolet    Junio       3  Camioneta         2
14        Monteria  Chevrolet    Junio       3       Moto       630
15         Sahagun     Toyota    Marzo       4       Auto        99
16         Sahagun       Ford    Enero       4    Camion        990
17          Lorica     Suzuki     Mayo       4    Omnibus         1
18          Lorica      Mazda    Enero       4  Camioneta         2
19       Tierralta      Mazda  Febrero       4       Moto       544>

In [84]:
venta_vehiculos.Ciudad

0           Monteria
1           Monteria
2             Cerete
3             Cerete
4             Lorica
5             Cerete
6           Monteria
7     Cienaga de Oro
8          Tierralta
9       Pueblo nuevo
10          Monteria
11      Pueblo nuevo
12            Pelayo
13            Pelayo
14          Monteria
15           Sahagun
16           Sahagun
17            Lorica
18            Lorica
19         Tierralta
Name: Ciudad, dtype: object

In [86]:
venta_vehiculos['Ciudad']

0           Monteria
1           Monteria
2             Cerete
3             Cerete
4             Lorica
5             Cerete
6           Monteria
7     Cienaga de Oro
8          Tierralta
9       Pueblo nuevo
10          Monteria
11      Pueblo nuevo
12            Pelayo
13            Pelayo
14          Monteria
15           Sahagun
16           Sahagun
17            Lorica
18            Lorica
19         Tierralta
Name: Ciudad, dtype: object

In [88]:
venta_vehiculos['Ciudad'][0]

'Monteria'

In [90]:
venta_vehiculos.iloc[0]

Ciudad      Monteria
Marca         Toyota
Mes            Enero
Semana             1
Vehiculo        Auto
Cantidad         105
Name: 0, dtype: object

In [91]:
venta_vehiculos.iloc[:,0]

0           Monteria
1           Monteria
2             Cerete
3             Cerete
4             Lorica
5             Cerete
6           Monteria
7     Cienaga de Oro
8          Tierralta
9       Pueblo nuevo
10          Monteria
11      Pueblo nuevo
12            Pelayo
13            Pelayo
14          Monteria
15           Sahagun
16           Sahagun
17            Lorica
18            Lorica
19         Tierralta
Name: Ciudad, dtype: object

In [109]:
venta_vehiculos.iloc[:4, 0]

0    Monteria
1    Monteria
2      Cerete
3      Cerete
Name: Ciudad, dtype: object

In [112]:
venta_vehiculos.iloc[3:5, 0]

3    Cerete
4    Lorica
Name: Ciudad, dtype: object

In [113]:
venta_vehiculos.iloc[[0, 3, 5], 0]

0    Monteria
3      Cerete
5      Cerete
Name: Ciudad, dtype: object

In [115]:
venta_vehiculos.iloc[-6:]

,Ciudad,Marca,Mes,Semana,Vehiculo,Cantidad,Toyota,index_backwards
14,Monteria,Chevrolet,Junio,3,Moto,630,everyone,6
15,Sahagun,Toyota,Marzo,4,Auto,99,everyone,5
16,Sahagun,Ford,Enero,4,Camion,990,everyone,4
17,Lorica,Suzuki,Mayo,4,Omnibus,1,everyone,3
18,Lorica,Mazda,Enero,4,Camioneta,2,everyone,2
19,Tierralta,Mazda,Febrero,4,Moto,544,everyone,1

In [96]:
venta_vehiculos.loc[0, 'Ciudad']

'Monteria'

In [98]:
venta_vehiculos.loc[:, ['Ciudad', 'Marca', 'Cantidad']]

            Ciudad      Marca  Cantidad
0         Monteria     Toyota       105
1         Monteria     Toyota         1
2           Cerete     Suzuki         2
3           Cerete     Toyota         2
4           Lorica     Suzuki       583
5           Cerete    Renault       121
6         Monteria    Renault         1
7   Cienaga de Oro      Mazda         1
8        Tierralta     Toyota         2
9     Pueblo nuevo      Mazda       485
10        Monteria     Suzuki       122
11    Pueblo nuevo  Chevrolet         1
12          Pelayo       Ford         2
13          Pelayo  Chevrolet         2
14        Monteria  Chevrolet       630
15         Sahagun     Toyota        99
16         Sahagun       Ford       990
17          Lorica     Suzuki         1
18          Lorica      Mazda         2
19       Tierralta      Mazda       544

In [99]:
venta_vehiculos.Ciudad == 'Monteria'

0      True
1      True
2     False
3     False
4     False
5     False
6      True
7     False
8     False
9     False
10     True
11    False
12    False
13    False
14     True
15    False
16    False
17    False
18    False
19    False
Name: Ciudad, dtype: bool

In [100]:
venta_vehiculos.loc[venta_vehiculos.Ciudad == 'Monteria']

      Ciudad      Marca    Mes  Semana Vehiculo  Cantidad
0   Monteria     Toyota  Enero       1     Auto       105
1   Monteria     Toyota  Enero       1  Camion          1
6   Monteria    Renault  Enero       2  Camion          1
10  Monteria     Suzuki  Abril       3     Auto       122
14  Monteria  Chevrolet  Junio       3     Moto       630

In [102]:
venta_vehiculos.loc[(venta_vehiculos.Ciudad == 'Monteria') & (venta_vehiculos.Cantidad >= 70)]

      Ciudad      Marca    Mes  Semana Vehiculo  Cantidad
0   Monteria     Toyota  Enero       1     Auto       105
10  Monteria     Suzuki  Abril       3     Auto       122
14  Monteria  Chevrolet  Junio       3     Moto       630

In [103]:
venta_vehiculos.loc[(venta_vehiculos.Ciudad == 'Lorica') | (venta_vehiculos.Cantidad >= 50)]

          Ciudad      Marca      Mes  Semana   Vehiculo  Cantidad
0       Monteria     Toyota    Enero       1       Auto       105
4         Lorica     Suzuki    Enero       1       Moto       583
5         Cerete    Renault  Febrero       2       Auto       121
9   Pueblo nuevo      Mazda    Marzo       2       Moto       485
10      Monteria     Suzuki    Abril       3       Auto       122
14      Monteria  Chevrolet    Junio       3       Moto       630
15       Sahagun     Toyota    Marzo       4       Auto        99
16       Sahagun       Ford    Enero       4    Camion        990
17        Lorica     Suzuki     Mayo       4    Omnibus         1
18        Lorica      Mazda    Enero       4  Camioneta         2
19     Tierralta      Mazda  Febrero       4       Moto       544

In [104]:
venta_vehiculos.loc[venta_vehiculos.Ciudad.isin(['Monteria', 'Lorica'])]

      Ciudad      Marca    Mes  Semana   Vehiculo  Cantidad
0   Monteria     Toyota  Enero       1       Auto       105
1   Monteria     Toyota  Enero       1    Camion          1
4     Lorica     Suzuki  Enero       1       Moto       583
6   Monteria    Renault  Enero       2    Camion          1
10  Monteria     Suzuki  Abril       3       Auto       122
14  Monteria  Chevrolet  Junio       3       Moto       630
17    Lorica     Suzuki   Mayo       4    Omnibus         1
18    Lorica      Mazda  Enero       4  Camioneta         2

In [105]:
venta_vehiculos.loc[venta_vehiculos.Cantidad.notnull()]

            Ciudad      Marca      Mes  Semana   Vehiculo  Cantidad
0         Monteria     Toyota    Enero       1       Auto       105
1         Monteria     Toyota    Enero       1    Camion          1
2           Cerete     Suzuki    Enero       1    Omnibus         2
3           Cerete     Toyota  Febrero       1  Camioneta         2
4           Lorica     Suzuki    Enero       1       Moto       583
5           Cerete    Renault  Febrero       2       Auto       121
6         Monteria    Renault    Enero       2    Camion          1
7   Cienaga de Oro      Mazda    Enero       2    Omnibus         1
8        Tierralta     Toyota    Marzo       2  Camioneta         2
9     Pueblo nuevo      Mazda    Marzo       2       Moto       485
10        Monteria     Suzuki    Abril       3       Auto       122
11    Pueblo nuevo  Chevrolet    Marzo       3    Camion          1
12          Pelayo       Ford     Mayo       3    Omnibus         2
13          Pelayo  Chevrolet    Junio       3  Camioneta         2
14        Monteria  Chevrolet    Junio       3       Moto       630
15         Sahagun     Toyota    Marzo       4       Auto        99
16         Sahagun       Ford    Enero       4    Camion        990
17          Lorica     Suzuki     Mayo       4    Omnibus         1
18          Lorica      Mazda    Enero       4  Camioneta         2
19       Tierralta      Mazda  Febrero       4       Moto       544

In [116]:
venta_vehiculos['Toyota'] = 'Toyota_Japan'
venta_vehiculos['Toyota']

0     Toyota_Japan
1     Toyota_Japan
2     Toyota_Japan
3     Toyota_Japan
4     Toyota_Japan
5     Toyota_Japan
6     Toyota_Japan
7     Toyota_Japan
8     Toyota_Japan
9     Toyota_Japan
10    Toyota_Japan
11    Toyota_Japan
12    Toyota_Japan
13    Toyota_Japan
14    Toyota_Japan
15    Toyota_Japan
16    Toyota_Japan
17    Toyota_Japan
18    Toyota_Japan
19    Toyota_Japan
Name: Toyota, dtype: object

In [108]:
venta_vehiculos['index_backwards'] = range(len(venta_vehiculos), 0, -1)
venta_vehiculos['index_backwards']

0     20
1     19
2     18
3     17
4     16
5     15
6     14
7     13
8     12
9     11
10    10
11     9
12     8
13     7
14     6
15     5
16     4
17     3
18     2
19     1
Name: index_backwards, dtype: int64

In [118]:
venta_vehiculos.Cantidad.describe()

count     20.000000
mean     184.800000
std      291.584528
min        1.000000
25%        1.750000
50%        2.000000
75%      212.750000
max      990.000000
Name: Cantidad, dtype: float64

In [120]:
venta_vehiculos.Marca.describe()

count         20
unique         6
top       Toyota
freq           5
Name: Marca, dtype: object

In [121]:
venta_vehiculos.Cantidad.mean()

184.8

In [122]:
venta_vehiculos.Marca.unique()

array(['Toyota', 'Suzuki', 'Renault', 'Mazda', 'Chevrolet', 'Ford'],
      dtype=object)

In [123]:
venta_vehiculos.Marca.value_counts()

Toyota       5
Suzuki       4
Mazda        4
Chevrolet    3
Renault      2
Ford         2
Name: Marca, dtype: int64

In [126]:
revision_venta_vehiculos_media = venta_vehiculos.Cantidad.mean()
venta_vehiculos.Cantidad.map(lambda p: p - revision_venta_vehiculos_media)

0     -79.8
1    -183.8
2    -182.8
3    -182.8
4     398.2
5     -63.8
6    -183.8
7    -183.8
8    -182.8
9     300.2
10    -62.8
11   -183.8
12   -182.8
13   -182.8
14    445.2
15    -85.8
16    805.2
17   -183.8
18   -182.8
19    359.2
Name: Cantidad, dtype: float64

In [127]:
def remean_cantidad(row):
    row.Cantidad = row.Cantidad - revision_venta_vehiculos_media
    return row

venta_vehiculos.apply(remean_cantidad, axis='columns')

,Ciudad,Marca,Mes,Semana,Vehiculo,Cantidad,Toyota,index_backwards
0,Monteria,Toyota,Enero,1,Auto,-79.8,Toyota_Japan,20
1,Monteria,Toyota,Enero,1,Camion,-183.8,Toyota_Japan,19
2,Cerete,Suzuki,Enero,1,Omnibus,-182.8,Toyota_Japan,18
3,Cerete,Toyota,Febrero,1,Camioneta,-182.8,Toyota_Japan,17
4,Lorica,Suzuki,Enero,1,Moto,398.2,Toyota_Japan,16
5,Cerete,Renault,Febrero,2,Auto,-63.8,Toyota_Japan,15
6,Monteria,Renault,Enero,2,Camion,-183.8,Toyota_Japan,14
7,Cienaga de Oro,Mazda,Enero,2,Omnibus,-183.8,Toyota_Japan,13
8,Tierralta,Toyota,Marzo,2,Camioneta,-182.8,Toyota_Japan,12
9,Pueblo nuevo,Mazda,Marzo,2,Moto,300.2,Toyota_Japan,11
10,Monteria,Suzuki,Abril,3,Auto,-62.8,Toyota_Japan,10
11,Pueblo nuevo,Chevrolet,Marzo,3,Camion,-183.8,Toyota_Japan,9
12,Pelayo,Ford,Mayo,3,Omnibus,-182.8,Toyota_Japan,8
13,Pelayo,Chevrolet,Junio,3,Camioneta,-182.8,Toyota_Japan,7
14,Monteria,Chevrolet,Junio,3,Moto,445.2,Toyota_Japan,6
15,Sahagun,Toyota,Marzo,4,Auto,-85.8,Toyota_Japan,5
16,Sahagun,Ford,Enero,4,Camion,805.2,Toyota_Japan,4
17,Lorica,Suzuki,Mayo,4,Omnibus,-183.8,Toyota_Japan,3
18,Lorica,Mazda,Enero,4,Camioneta,-182.8,Toyota_Japan,2
19,Tierralta,Mazda,Febrero,4,Moto,359.2,Toyota_Japan,1

In [128]:
venta_vehiculos.head(1)

,Ciudad,Marca,Mes,Semana,Vehiculo,Cantidad,Toyota,index_backwards
0,Monteria,Toyota,Enero,1,Auto,105,Toyota_Japan,20

In [129]:
revision_venta_vehiculos_media = venta_vehiculos.Cantidad.mean()
venta_vehiculos.Cantidad - revision_venta_vehiculos_media

0     -79.8
1    -183.8
2    -182.8
3    -182.8
4     398.2
5     -63.8
6    -183.8
7    -183.8
8    -182.8
9     300.2
10    -62.8
11   -183.8
12   -182.8
13   -182.8
14    445.2
15    -85.8
16    805.2
17   -183.8
18   -182.8
19    359.2
Name: Cantidad, dtype: float64

In [130]:
venta_vehiculos.Ciudad + " - " + venta_vehiculos.Marca

0            Monteria - Toyota
1            Monteria - Toyota
2              Cerete - Suzuki
3              Cerete - Toyota
4              Lorica - Suzuki
5             Cerete - Renault
6           Monteria - Renault
7       Cienaga de Oro - Mazda
8           Tierralta - Toyota
9         Pueblo nuevo - Mazda
10           Monteria - Suzuki
11    Pueblo nuevo - Chevrolet
12               Pelayo - Ford
13          Pelayo - Chevrolet
14        Monteria - Chevrolet
15            Sahagun - Toyota
16              Sahagun - Ford
17             Lorica - Suzuki
18              Lorica - Mazda
19           Tierralta - Mazda
dtype: object

In [146]:
venta_vehiculos.groupby('Cantidad').Cantidad.count()

KeyError: 'Cantidad'

In [141]:
venta_vehiculos = pd.read_csv("/Machine Learning/Data/mydata_sales.csv")

In [142]:
venta_vehiculos.head

<bound method NDFrame.head of    Ventas Enero  Ventas Febrero   Ventas Marzo
0           130             201            900
1           350             340            100
2           410            1110           2011
3           677            6000           5500
4           550             700            800
5         36900            4000           5500>

In [143]:
venta_vehiculos.groupby('Cantidad').Precio_Unitario.min()

KeyError: 'Cantidad'

In [144]:
venta_vehiculos.groupby('Cantidad').Cantidad.count()

KeyError: 'Cantidad'